org/books/are_we_smart_enough_to_know_how_smart_animals_are.org
#+SETUPFILE:./hugo_setup.org
#+TITLE: Are We Smart Enough to Know How Smart Animals Are?

Why is it that facial expression is universally consistent?

* Language As Root Of Thought

If language were at the root of thought, why is it that we sometimes
find ourselves at a loss for words?

Language is one of the distinguishing features of the human species.
Other species are able to exhibit similar or higher levels of
cognitive function without an equally powerful language.

As humans, we are able to use language to communicate ideas that
transcend time, and this has been essential for our survival.
